
/**
 * (I)
 * a.) שגיאת קומפילציה מפני שערך המשקל הוא פרטי, לכן לא ניתן לפנות אליו כך
 * b.) לא ניתן לעשות קאסטין לעגבניה לפלפל למרות שמקום האובייקט הוא באוג'קט, הרעיון הוא שהן לא יורשות אחת מהשניה
 * c.) שקר, לא יודע*****************************************
 * d.) אמת, מפני שהשיטה נדרסת
 * e.) שקר בדוק
 */
public class Q4
{
    public static void main (String []args)
{
Tomato y1 = new Tomato (10);
Object y2 = new Tomato (10);
Pepper z1 = new Pepper (10);
Object z2 = new Pepper (10);

System.out.println (z1.equals((Tomato)y2));
}
}

/**
 * (II)
 * a.) השיטה מחזירה 3
 * b.) השיטה מחזירה את דרגת הבן בעל הדרגה המקס'
 */
